# ოპერაცია - რაიმე დავალება კომპიუტერისთვის
#ოპერატორი - ისეთი რამ რაც ამ დავალების შესრულებაში ეხმარება კომპიუტერს
#პრინტ(5 + 5)
# < - ნაკლებია
# > - მეტია
# == - ტოლია
# != - არ არის ტოლი
# <= - ნაკლებია ან ტოლია
# >= - მეტია ან ტოლია

#ყველა შედარების ოპერაციის შედეგი არის BooLean


# == არის ტოლობის შექმნა
# = არის ცვლადის შექმნა


#1)გატესტეთ ყველა შედარების ოპერატორი რაც დღეს ვისწავლეთ (ყველაზე გააკეთ 3-3 მაგალითი)
# >
print(10 > 5)
print(9 > 19)
print(130 > 133)

# <
print(15 < 30)
print(90 < 169)
print(156 < 39)

# !=
print(6 != 1)
print(12 != 125)
print(356 != 238)


# ==
print(5 == 5)
print(900 == 1200)
print(214 == 214)


# <=
print(921 <= 921)
print(124 <= 125)
print(423 <= 521)


# >=
print(1234 >= 1245)
print(876 >= 678)
print(543 >= 543)




#2)შექმენით ცვლადი soil_moisture და შეამოწმეთ უნდა მოირწყოს სისტემა თუ არა, sololearnში მოცემული მაგალითის მიხედვით
number = int(input("soil moisture = "))
soil_moisture = 80
print(soil_moisture >= number)
