#list არის mutable და შეგვიძლია შევცვალოთ მასში მყოფი ელემენტები დავამატოთ ან წავშალოთ. რომელიც იხსნება კვადრატული ფრჩხილებით []
#მაგალითად : 
list_1=[1,2,3]



#tuple არის immutable და მასში მყოფ ელემენტებს ვერ შევცვლით, იგი გამოიყენება ინფორმაციის შესანახად ეგრეწოდებულ ბაზად. ის ასევე იხსნება () ფრჩხილებით
#მაგალითად:
tuple1=[1,2,3]



#set შედგება არაერთხელ განმეორებადი ელემენტებით, ინდექსირებადი. და იგი იხსნება {}
#მაგალითად: 
set1={1,2,3}


#list და tuple შორის განსხვავებები და სერთოები
#საერთო: ორივე ელემენტებს შეიცავს და ინდექსირებულები არიან
#განსხვავება: სიები არის mutable, ტუპლები კი immutable. და ისინი ფრჩხილებით განსხვავდებიან



#list და set შორის განსხვავებები და საერთოები
#განსხვავება: სიები ინდექსირებულია და დუბლირებულ ელემენტებს შეიცავს, და განსხვავდებიან ფრჩხილებით
#საერთო: ორივე შეიცავს ელემენტებს

my_set = {1, 2, 3}
my_set.add(4)
print(my_set) 

my_set.remove(2)
print(my_set)
#add და remove მხოლოდ სეტზე მუშაობს
